snlkuharlocal/src/DataProcessors/АвтоформированиеМаркировкиНаБТК/АвтоформированиеМаркировкиНаБТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АвтоформированиеМаркировкиНаБТК</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ПланФакт/ПланФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПланФакт</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>ПланКорректировка</name>
  </enumValues>
  <enumValues>
    <name>БизнесПлан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ХранилищеКодовМаркировки/ХранилищеКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХранилищеКодовМаркировки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ПередачаКодовМаркировкиМП</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <basedOn>Document.МаркировкаОстатковТЦ</basedOn>
  <basedOn>Document.Претензия</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ВыкупИМ</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.Возврат1ИМ</types>
      <types>DocumentRef.МаркировкаОстатковТЦ</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.ПередачаКодовМаркировкиМП</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Претензия</types>
      <types>DocumentRef.ЗаказИМ</types>
      <types>DocumentRef.ОприходованиеТМЦ</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.ВозвратИМ</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупповыхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтучныхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланФакт</name>
    <type>
      <types>EnumRef.ПланФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоШтуквХКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <comment>Не нанесен</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/АвтоформированиеМаркировкиНаБТК/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	
	//////+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец     
		ЗаписатьВЛог("Маркировка","Отмена выполнения. Задача: Формирование РНК маркировки на БТК. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
		
	СгенерироватьУПД_БТК(); 
	
	СгенерироватьУПД_МПС();

			
	ЗаписатьВЛог("Маркировка","Конец выполнения. Задача:  Загрузка ПНК из Сферы Курьер. !","Информация");                     

	
КонецПроцедуры	


процедура  СгенерироватьУПД_БТК_ст()
	
	// проверим, что уже не создано 
	Организация = Справочники.Организации.НайтиПоКоду("SS-001");  // европа временно
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("SST-0235");   // бтк
	ПунктДоставки = справочники.ПунктыДоставки.НайтиПоКоду("SNL-027009");
	Договор = справочники.Договоры.НайтиПоКоду("SNL-031493");
	Склад = справочники.Склады.НайтиПоКоду("STD-66");
	// Тип операции - комиссия, цены теже, берем только маркированный товар.
	ДатаТекПоиска = Дата(2024,09,24); //день назад потом.

	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	               |ГДЕ
	               |	РасходнаяНакладная.Организация = &ТекОрг
	               |	И РасходнаяНакладная.Контрагент = &ТекКонтр
	               |	И РасходнаяНакладная.Отгружен = &отгружен
	               |	И РасходнаяНакладная.Дата = &ДатаНач
	               |	И РасходнаяНакладная.Проведен = ИСТИНА
	               |	И РасходнаяНакладная.ТребуетсяМаркировка = ИСТИНА
	               |	И РасходнаяНакладная.КодОперации = &комиссия
	               |	И РасходнаяНакладная.Склад = &ТекСклад";
	Запрос.УстановитьПараметр("ТекОрг",Организация);
	Запрос.УстановитьПараметр("ТекКонтр",Контрагент);
	Запрос.УстановитьПараметр("ТекСклад",Склад);

	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаТекПоиска));
	Запрос.УстановитьПараметр("отгружен",перечисления.Отгружен.Отгружен);
	Запрос.УстановитьПараметр("комиссия",перечисления.КодыОперацийОстатки.Комиссия);

	Рез = Запрос.Выполнить().Выгрузить();
	Если рез.Количество()>0 Тогда
		//сообщить("Документ уже сформирован!");
		//записатьВлог();
		ЗаписатьВЛог("Маркировка","Документ уже сформирован!"+ТекущаяДата(),,,,);
		возврат;
	КонецЕсли;	
	
	//-------------------------------------------------------------------------------------
	ОрганизацияПоиска =  Справочники.Организации.НайтиПоКоду("SSP-99");  // бтк
	КонтрагентПоиска = Справочники.Контрагенты.НайтиПоКоду("SSR-9059");;   // РВБ
	
	//
	//// Тип операции - комиссия, цены теже, берем только маркированный товар.
	//ДатаТекПоиска = Дата(2024,09,24); //день назад потом.
	//

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	               |ГДЕ
	               |	РасходнаяНакладная.Организация = &ТекОрг
	               |	И РасходнаяНакладная.Контрагент = &ТекКонтр
	               |	И РасходнаяНакладная.Отгружен = &отгружен
	               |	И РасходнаяНакладная.Дата >= &ДатаНач
	               |	И РасходнаяНакладная.Дата <= &ДатаКон
	               |	И РасходнаяНакладная.Проведен = ИСТИНА
	               |	И РасходнаяНакладная.ТребуетсяМаркировка = ИСТИНА
				   |	И РасходнаяНакладная.МеждуСвоимиОрганизациями = истина
	               |	И РасходнаяНакладная.КодОперации = &комиссия";
	
	Запрос.УстановитьПараметр("ТекОрг",ОрганизацияПОиска);
	
	Запрос.УстановитьПараметр("ТекКонтр",КонтрагентПоиска);
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаТекПоиска));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаТекПоиска));
	Запрос.УстановитьПараметр("отгружен",перечисления.Отгружен.Отгружен);
	Запрос.УстановитьПараметр("комиссия",перечисления.КодыОперацийОстатки.Комиссия);

	
	Рез = Запрос.Выполнить().Выгрузить();
		
	СписокРНК = рез.ВыгрузитьКолонку("Ссылка");
	
	//Сообщить("Количество РНК "+СписокРНК.Количество()+" "+КонтрагентПоиска+" "+ОрганизацияПоиска);
	
	Если СписокРНК.Количество()=0 Тогда
		
		ЗаписатьВЛог("Маркировка","Документов для передачи на бтк с маркировкой нет! "+ТекущаяДата(),,,,);
		возврат;
	КонецЕсли;	
	
	
	СсылкаНаОбъект = СписокРНК[0];
	
	// таблица марок
	//-----------------------------------------------------------------------------------------------------------------
	ТаблицаМарок = Новый ТаблицаЗначений;
	
	ТаблицаМарок.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
	ТаблицаМарок.Колонки.Добавить("количество", Новый ОписаниеТипов("Число"));
	ТаблицаМарок.Колонки.Добавить("Товар",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаМарок.Колонки.Добавить("Модель",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаМарок.Колонки.Добавить("ТипШК",Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихКодов"));
	ТаблицаМарок.Колонки.Добавить("ТипШкЗн", Новый ОписаниеТипов("Число"));
 
	ДатаПр = СсылкаНаОбъект.дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистНабораШтрихкодыУпаковок.Ссылка КАК ссылка,
	               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	               |	1 КАК Количество,
	               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Товар,
	               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование КАК Штрихкод,
	               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК КАК ТипШК,
	               |	ВЫБОР
	               |		КОГДА ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.типыШтрихкодов.Штука)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК ТипШкЗн,
	               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец.Родитель КАК Модель,
	               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Ссылка КАК Марка
	               |ИЗ
	               |	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	               |ГДЕ
	               |	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование В ИЕРАРХИИ(&ТекДок)
	               |	И ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование.Дата >= &ТекДата
	               |	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Товар,
	               |	ТипШК,
	               |	Штрихкод";
	
	Запрос.УстановитьПараметр("ТекДок",СписокРНК);
	Запрос.УстановитьПараметр("ТекДата",ДатаПР);
	
	ТаблицаМарок = Запрос.Выполнить().Выгрузить(); //
	
	//----------------------------------------------------------------------------------------------------------------------
	//  формирование самого РНК. Выбираем только маркированный товар из списка РНК	
	//----------------------------------------------------------------------------------------------------------------------
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", СписокРНК);
	Запрос.УстановитьПараметр("ПустаяЕдиница", Справочники.Единицы.ПустаяСсылка());
	Кратко= ложь;
		
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Товар,
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Номенклатура.Наименование КАК СТРОКА(200)) КАК ТоварНаименование,
		|	РеализацияТоваровУслугТовары.Единица.Представление КАК ЕдиницаИзмерения,
		|	РеализацияТоваровУслугТовары.Единица.ОКЕИ.Код КАК ЕдиницаИзмеренияКод,
		|	РеализацияТоваровУслугТовары.Количество КАК Количество,
		|	РеализацияТоваровУслугТовары.Цена КАК Цена,
		|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
		|	РеализацияТоваровУслугТовары.НДС КАК СуммаНДС,
		|	РеализацияТоваровУслугТовары.Всего КАК Сумма,
		|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
		|	1 КАК НомерТЧ,
		|	РеализацияТоваровУслугТовары.Номенклатура.Родитель КАК Модель,
		|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК Артикул,
		|	РеализацияТоваровУслугТовары.ПодтвержденнаяЗаявка КАК ПодтвержденнаяЗаявка,
		|	РеализацияТоваровУслугТовары.Заявка КАК Заявка,
		|	РеализацияТоваровУслугТовары.Всего КАК Всего
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка В ИЕРАРХИИ(&ДокументОснование)
		|	И РеализацияТоваровУслугТовары.Всего > 0
		|	И ВЫБОР
		|			КОГДА ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1))
		|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|		КОНЕЦ <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ВЫБОР
		|			КОГДА ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1))
		|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|		КОНЕЦ < РеализацияТоваровУслугТовары.Ссылка.ДатаОтгрузки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерТЧ,
		|	НомерСтроки";
	
	ВыборкаСтрокТоварыТЗ = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	
	// шапку заполнять по первому документу?
	// первый документ
	Док1= СписокРНК[0];
	ДокПолучатель=Документы.РасходнаяНакладная.СоздатьДокумент();	
	ЗаполнитьШапкуДокумента(ДокПолучатель,ПараметрыСеанса.Пользователь);
		
	ШаблонРеквизитов = "ИБ,Менеджер,БанковскийСчет,ДатаОтгрузки,Валюта,
	|ОтсрочкаПлатежа,ВидОплаты,ТипЦен,ТипСкидок,Скидка,ТранспортнаяКомпания,СкладКомиссия,ДатаОплаты,КодПоставщика";	
		
	СписокРеквизитов = ЗаполнениеДокументов.СформироватьСтрокуРеквизитовПоШаблону(Док1, ШаблонРеквизитов);
	ЗаполнитьЗначенияСвойств(ДокПолучатель, Док1, СписокРеквизитов);
	ДокПолучатель.ТребуетсяМаркировка =истина;
	ДокПолучатель.МеждуСвоимиОрганизациями = истина;
	ДокПолучатель.Организация = Организация;
	Докполучатель.Договор =договор;
	ДокПолучатель.Контрагент = контрагент;
	ДокПолучатель.Склад = склад;
	ДокПолучатель.ПунктДоставки = ПунктДоставки;
	ДокПолучатель.СостояниеНакладной = перечисления.СостоянияНакладной.Отгружена;
	ДокПолучатель.Отгружен = перечисления.Отгружен.Отгружен;
	ДокПолучатель.КодОперации = перечисления.КодыОперацийОстатки.Комиссия;
	
	ДокПолучатель.Подразделение = ДокПолучатель.Менеджер.Подразделение;
	Если ДокПолучатель.Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		ДокПолучатель.Подразделение = ДокПолучатель.Склад.Подразделение;
	КонецЕсли;

	
	Пока Выборка.Следующий() Цикл
		//ОбработкаПрерыванияПользователя();
		
	//	Состояние("Обработка: "+Выборка.Номенклатура);
		
		Если Выборка.Количество()=0 Тогда Продолжить КонецЕсли;
		
		СтрокаТЧ=ДокПолучатель.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
		
		СтрокаТЧ.Заявка=Выборка.Количество;	
		СтрокаТЧ.ПодтвержденнаяЗаявка=Выборка.Количество;	
			
		СтрокаТЧ.Всего=Выборка.Всего;
		
		ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ,ДокПолучатель);
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокПолучатель,"ОтВсего");
		
	КонецЦикла;	
	

    //  временно
	Для Каждого Накладная Из СписокРНК Цикл
		Если ПустаяСтрока(ДокПолучатель.Комментарий) Тогда 
			ДокПолучатель.Комментарий = Накладная.Метаданные().Имя + " " + Накладная.Номер;
		иначе
			ДокПолучатель.Комментарий = ДокПолучатель.Комментарий + ", " + Накладная.Номер;
		КонецЕсли;
	КонецЦикла;
	//ДокПолучатель.ПолучитьФорму().Открыть();
	ДокПолучатель.Дата =  док1.датаОтгрузки; 
	попытка
		ДокПолучатель.Записать(РежимЗаписиДокумента.Проведение);
	исключение
		ЗаписатьВЛог("Маркировка","Не удалось записать документ РНК, на БТК - "+ТекущаяДата()+" "+ОписаниеОшибки(),,,,);
		
	КонецПопытки;
	//	сообщить(ДокПолучатель);

	//------------------------------------------------------------------------------------------
	//      создаем ХКМ
	//------------------------------------------------------------------------------------------
	
	
	//----------------------------------------------
	ДокументХКМ = Документы.ХранилищеКодовМаркировки.ПустаяСсылка();  //.Создать_ХКМ_к_ПНК_План(ДокументДляЗагрузки);
	
	ДокументХКМ = документы.ХранилищеКодовМаркировки.СоздатьДокумент();
	ДокументХКМ.Автор = ПараметрыСеанса.Пользователь;
	ДокументХКМ.ДокОснование = ДокПолучатель.ссылка;
	ДокументХКМ.Организация = ДокПолучатель.организация;
	ДокументХКМ.ПланФакт = перечисления.ПланФакт.План;
	ДокументХКМ.Получатель = ДокПолучатель.контрагент; //???
	ДокументХКМ.Комментарий = "Передача на БТК (для РВБ)";
	ДокументХКМ.дата =  ДокПолучатель.дата;
	//ДокументХКМ.УстановитьНовыйНомер( "PPP"+"-");
	
	// заполняем марками
	//-------------------------------------------
	Для каждого ТекстрМ из ТаблицаМарок Цикл
		ТекМаркаТ = ТекстрМ.Марка;
		//сообщить(ТекстрМ.Марка);
		МаркаН = ДокументХКМ.ШтрихкодыУпаковок.добавить();
		МаркаН.ШтрихкодУпаковки = ТекстрМ.Марка;
	КонецЦикла;
	
	попытка
		ДокументХКМ.Записать(РежимЗаписиДокумента.Проведение);
	исключение
		ЗаписатьВЛог("Маркировка","Не удалось записать документ ХКМ, на БТК - "+ТекущаяДата()+" "+ОписаниеОшибки(),,,,);
	КонецПопытки;

//	сообщить(ДокПолучатель);
//	сообщить( ДокументХКМ);
//	//-----------------------------------------------
//	
//	
	КонецПроцедуры


процедура  СгенерироватьУПД_БТК()
	ЕстьОШибка= ложь;

	// проверим, что уже не создано 
	Организация = Справочники.Организации.НайтиПоКоду("SS-001");  // европа временно
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("SST-0235");   // бтк
	ПунктДоставки = справочники.ПунктыДоставки.НайтиПоКоду("SNL-027009");
	Договор = справочники.Договоры.НайтиПоКоду("SNL-031493");
	Склад = справочники.Склады.НайтиПоКоду("STD-66");
	// Тип операции - комиссия, цены теже, берем только маркированный товар.
	Дата1 =  ТекущаяДата()- 30*24*60*60; //константы.ДатаЗапретаРедактирования.Получить();  //с даты запрета редактирования
	Дата2 = ТекущаяДата()-24*60*60;  // вчерашний день
	
	// проверка, что уже есть - не нужно, будем смотреть по маркам.
	//-------------------------------------------------------------------------------------
	// выбрали все РНК, что есть, по условиям, и проверим все ли марки по ним отправлены, чтобы ускорить запрос.
	ОрганизацияПоиска =  Справочники.Организации.НайтиПоКоду("SSP-99");  // бтк
	КонтрагентПоиска = Справочники.Контрагенты.НайтиПоКоду("SSR-9059");;   // РВБ
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	               |ГДЕ
	               |	РасходнаяНакладная.Организация = &ТекОрг
	               |	И РасходнаяНакладная.Контрагент = &ТекКонтр
	               |	И РасходнаяНакладная.Отгружен = &отгружен
	               |	И РасходнаяНакладная.Дата >= &ДатаНач
	               |	И РасходнаяНакладная.Дата <= &ДатаКон
	               |	И РасходнаяНакладная.Проведен = ИСТИНА
	               |	И РасходнаяНакладная.ТребуетсяМаркировка = ИСТИНА
	               |	И РасходнаяНакладная.КодОперации = &комиссия";

	Запрос.УстановитьПараметр("ТекОрг",ОрганизацияПОиска);
	Запрос.УстановитьПараметр("ТекКонтр",КонтрагентПоиска);
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Дата2));
	Запрос.УстановитьПараметр("отгружен",перечисления.Отгружен.Отгружен);
	Запрос.УстановитьПараметр("комиссия",перечисления.КодыОперацийОстатки.Комиссия);
	
	Рез = Запрос.Выполнить().Выгрузить();
		
	СписокРНК = рез.ВыгрузитьКолонку("Ссылка");
	
//	Сообщить("Количество РНК "+СписокРНК.Количество()+" "+КонтрагентПоиска+" "+ОрганизацияПоиска);
	
	//---------------------------------------------------------------------------------------------
	//              выберем все неотправленные марки по этим РНК , их потом будем добавлять в ХКМ
	//----------------------------------------------------------------------------------------------
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки КАК ШтрихКодУпаковки,
	               |	СтатусыКМ_ЧЗСрезПоследних.Регистратор.ДокОснование КАК РегистраторДокОснование,
	               |	СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки.Владелец КАК Товар,
	               |	СУММА(ВложенныйЗапрос.ПризнакБТК) КАК ПризнакБТК,
	               |	СтатусыКМ_ЧЗСрезПоследних.Статус КАК Статус
	               |ПОМЕСТИТЬ ДанныеПоМаркам
	               |ИЗ
	               |	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_ЧЗСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			СтатусыКМ_Факт.Местонахождение КАК Местонахождениеб,
	               |			СтатусыКМ_Факт.ШтрихКодУпаковки КАК ШтрихКодУпаковкиб,
	               |			ВЫБОР
	               |				КОГДА СтатусыКМ_Факт.Местонахождение = &бтк
	               |					ТОГДА 1
	               |				ИНАЧЕ 0
	               |			КОНЕЦ КАК ПризнакБТК
	               |		ИЗ
	               |			РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт) КАК ВложенныйЗапрос
	               |		ПО СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки = ВложенныйЗапрос.ШтрихКодУпаковкиб
	               |ГДЕ
	               |	СтатусыКМ_ЧЗСрезПоследних.Регистратор.ДокОснование В ИЕРАРХИИ(&текрнк)
	               |	И СтатусыКМ_ЧЗСрезПоследних.Статус <> &Выбыл
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки,
	               |	СтатусыКМ_ЧЗСрезПоследних.Регистратор,
	               |	СтатусыКМ_ЧЗСрезПоследних.Местонахождение,
	               |	СтатусыКМ_ЧЗСрезПоследних.Регистратор.ДокОснование,
	               |	СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки.Владелец,
	               |	СтатусыКМ_ЧЗСрезПоследних.Период,
	               |	СтатусыКМ_ЧЗСрезПоследних.Активность,
	               |	ВложенныйЗапрос.ШтрихКодУпаковкиб,
	               |	СтатусыКМ_ЧЗСрезПоследних.Статус
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеПоМаркам.ШтрихКодУпаковки КАК марка,
	               |	ДанныеПоМаркам.ШтрихКодУпаковки.Владелец КАК Номенклатура,
	               |	ДанныеПоМаркам.РегистраторДокОснование КАК ДокРНК,
	               |	ДанныеПоМаркам.ПризнакБТК КАК ПризнакБТК,
	               |	ВложенныйЗапрос.Цена КАК Цена,
	               |	ВложенныйЗапрос.Скидка КАК Скидка,
	               |	1 КАК Количество,
	               |	ВложенныйЗапрос.ЦенаБезСкидки КАК ЦенаБезСкидки,
	               |	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	               |	ВложенныйЗапрос.Ссылка1 КАК Ссылка1
	               |ИЗ
	               |	ДанныеПоМаркам КАК ДанныеПоМаркам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	               |			РасходнаяНакладнаяТовары.Цена КАК Цена,
	               |			РасходнаяНакладнаяТовары.ТипЦен КАК ТипЦен,
	               |			РасходнаяНакладнаяТовары.Скидка КАК Скидка,
	               |			РасходнаяНакладнаяТовары.ЦенаБезСкидки КАК ЦенаБезСкидки,
	               |			РасходнаяНакладнаяТовары.Ссылка КАК Ссылка,
	               |			РасходнаяНакладнаяТовары.СтавкаНДС КАК СтавкаНДС,
	               |			РасходнаяНакладнаяТовары.Ссылка КАК Ссылка1
	               |		ИЗ
	               |			Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |		ГДЕ
	               |			РасходнаяНакладнаяТовары.Ссылка В ИЕРАРХИИ(&текрнк)) КАК ВложенныйЗапрос
	               |		ПО ДанныеПоМаркам.РегистраторДокОснование = ВложенныйЗапрос.Ссылка
	               |			И ДанныеПоМаркам.Товар = ВложенныйЗапрос.Номенклатура
	               |ГДЕ
	               |	ДанныеПоМаркам.ПризнакБТК = 0";
	Запрос.УстановитьПараметр("ТекРНК", СписокРнк);
	Запрос.УстановитьПараметр("бтк", Справочники.Контрагенты.НайтиПоКоду("SST-0235"));
	Запрос.УстановитьПараметр("Выбыл", Перечисления.СтатусыКодовМаркировкиФакт.Выбыл);
	

	ТЗТовары_Марки =запрос.Выполнить().Выгрузить();
	// тут и цены сразу, и товары, и марки.
	
	Если ТЗТовары_Марки.Количество()<=0 ТОгда
		ЕстьОШибка=истина;

		//сообщить("Не отправленных марок по РВБ на БТК нет, документы не сформированы!"+ТекущаяДата());
		ЗаписатьВЛог("Маркировка","Не отправленных марок по РВБ на БТК нет, документы не сформированы!"+ТекущаяДата(),,,,);
		возврат;
		 
	КонецЕсли;	
	
	//ТЗТовары_Марки.Свернуть("Марка, Номенклатура, Цена, ЦенаБезСкидки,ДокРНК","Количество");

	ТЗТОвары = ТЗТовары_Марки.Скопировать();
	ТЗТовары.Свернуть("Номенклатура, Цена, ЦенаБезСкидки","Количество");

	
	СсылкаНаОбъект = СписокРНК[0];
	//возврат;
	// шапку заполнять по первому документу
	// первый документ
	Док1= СписокРНК[0];
	ДокПолучатель=Документы.РасходнаяНакладная.СоздатьДокумент();	
	ЗаполнитьШапкуДокумента(ДокПолучатель,ПараметрыСеанса.Пользователь);
		
	ШаблонРеквизитов = "ИБ,Менеджер,БанковскийСчет,ДатаОтгрузки,Валюта,
	|ОтсрочкаПлатежа,ВидОплаты,ТипЦен,ТипСкидок,Скидка,ТранспортнаяКомпания,СкладКомиссия,ДатаОплаты,КодПоставщика";	
		
	СписокРеквизитов = ЗаполнениеДокументов.СформироватьСтрокуРеквизитовПоШаблону(Док1, ШаблонРеквизитов);
	ЗаполнитьЗначенияСвойств(ДокПолучатель, Док1, СписокРеквизитов);
	ДокПолучатель.ТребуетсяМаркировка =истина;
	ДокПолучатель.МеждуСвоимиОрганизациями = истина;
	ДокПолучатель.Организация = Организация;
	Докполучатель.Договор =договор;
	ДокПолучатель.Контрагент = контрагент;
	ДокПолучатель.Склад = склад;
	ДокПолучатель.ПунктДоставки = ПунктДоставки;
	ДокПолучатель.СостояниеНакладной = перечисления.СостоянияНакладной.Отгружена;
	ДокПолучатель.Отгружен = перечисления.Отгружен.Отгружен;
	ДокПолучатель.КодОперации = перечисления.КодыОперацийОстатки.Комиссия;
	ДокПолучатель.Дата = КонецДня(текущаядата()-24*60*60);
	ДокПолучатель.ДатаОтгрузки = текущаядата()-24*60*60; //--------- 
	//++Данилова Е.В. 30.09.2025  HELP-7048 
	//ДокПолучатель.Подразделение = ДокПолучатель.Менеджер.Подразделение;
	ДокПолучатель.Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(ДокПолучатель.Менеджер);
	//--Данилова Е.В. 30.09.2025
	Если ДокПолучатель.Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		ДокПолучатель.Подразделение = ДокПолучатель.Склад.Подразделение;
	КонецЕсли;  
	//нечаева 22,10,25+++
	ТипДоставки=ПунктДоставки.ТипДоставки;
	// нечаева 22,10,25---

	
	// заполняем товары
	Для каждого ТекСтрока из ТЗТовары Цикл    // только по товарам, чтобы свернулось
		//ОбработкаПрерыванияПользователя();
		//Состояние("Обработка: " + ТекСтрока.Номенклатура);
		
		Если ТекСтрока.количество =0 Тогда Продолжить КонецЕсли;
		
		СтрокаТЧ = ДокПолучатель.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ТекСтрока);
		
		СтрокаТЧ.Заявка=ТекСтрока.Количество;	
		СтрокаТЧ.ПодтвержденнаяЗаявка=ТекСтрока.Количество;	
			
		СтрокаТЧ.Цена=ТекСтрока.Цена;
		
		ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ,ДокПолучатель);
		СтрокаТЧ.ЦенаБезСкидки=ТекСтрока.Цена;

		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокПолучатель,Неопределено);  //"ОтВсего");
		
	КонецЦикла;	
	КонтрольДублейСтрок(ДокПолучатель);

	// свернуть по строкам?
	ПересчетТЧ(ДокПолучатель,"Товары",ДокПолучатель.Валюта,ДокПолучатель.Валюта,ДокПолучатель.Курс,ДокПолучатель.Курс,Истина);
	
	// ??? временно
	Для Каждого Накладная Из СписокРНК Цикл
		Если ПустаяСтрока(ДокПолучатель.Комментарий) Тогда 
			ДокПолучатель.Комментарий = Накладная.Метаданные().Имя + " " + Накладная.Номер;
		иначе
			ДокПолучатель.Комментарий = ДокПолучатель.Комментарий + ", " + Накладная.Номер;
		КонецЕсли;
	КонецЦикла;
	//ДокПолучатель.ПолучитьФорму().Открыть();
	
	//ДокПолучатель.Дата =  КонецДня(док1.датаОтгрузки); 
	ЕстьОшибка = ложь;
	попытка
		ДокПолучатель.Записать(РежимЗаписиДокумента.Проведение);
	исключение
		ЕстьОШибка=истина;
		ЗаписатьВЛог("Маркировка","Не удалось записать документ РНК, на БТК - "+ТекущаяДата()+" "+ОписаниеОшибки(),,,,);
		возврат; // чтобы не писалась ХКМ, и марки остануться на БТК, без УПД
	КонецПопытки;
	
	//------------------------------------------------------------------------------------------
	//      создаем ХКМ
	//------------------------------------------------------------------------------------------
	
	Если ЕстьОШибка=истина ТОгда
		возврат;
	КонецЕсли;	
	
	ДокументХКМ = Документы.ХранилищеКодовМаркировки.ПустаяСсылка(); 
	
	ДокументХКМ = документы.ХранилищеКодовМаркировки.СоздатьДокумент();
	ДокументХКМ.Автор = ПараметрыСеанса.Пользователь;
	ДокументХКМ.ДокОснование = ДокПолучатель.ссылка;
	ДокументХКМ.Организация = ДокПолучатель.организация; // единая европа?  пусть пока бтк
	ДокументХКМ.ПланФакт = перечисления.ПланФакт.План;
	ДокументХКМ.Получатель = ДокПолучатель.контрагент; //???  бтк
	ДокументХКМ.Комментарий = "Передача на БТК (для РВБ)";
	ДокументХКМ.дата =  КонецДня(текущаядата()-24*60*60);//КонецДня(ДокПолучатель.дата);
	ДокументХКМ.УстановитьНовыйНомер( "PPP"+"-");
	
	// заполняем марками
	//-------------------------------------------
	ТЗТовары_Марки.Сортировать("Марка");
	
	Для каждого ТекстрМ из ТЗТовары_Марки цикл   
		ТекМаркаТ = ТекстрМ.Марка;
		//сообщить(ТекстрМ.Марка);
		МаркаН = ДокументХКМ.ШтрихкодыУпаковок.добавить();
		МаркаН.ШтрихкодУпаковки = ТекстрМ.Марка;
	КонецЦикла;
	
	попытка
		ДокументХКМ.Записать(РежимЗаписиДокумента.Проведение);
	исключение
		ЗаписатьВЛог("Маркировка","Не удалось записать документ ХКМ, на БТК - "+ТекущаяДата()+" "+ОписаниеОшибки(),,,,);
		//сообщить(описаниеошибки());
	КонецПопытки;

	//сообщить(ДокПолучатель);
	//сообщить(ДокументХКМ);
	//-----------------------------------------------
	


	
КонецПроцедуры

// нечаева 19,09,25++ аналогичное, для МП Стиля.
процедура  СгенерироватьУПД_МПС()
	ЕстьОШибка= ложь;

	// проверим, что уже не создано 
	Организация = Справочники.Организации.НайтиПоКоду("SS-001");  // европа 
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("SST-3886");   // МП Стиль
	ПунктДоставки = справочники.ПунктыДоставки.НайтиПоКоду("SNL-027852");
	Договор = справочники.Договоры.НайтиПоКоду("SNL-032131");
	Склад = справочники.Склады.НайтиПоКоду("STD-66");
	// Тип операции - комиссия, цены теже, берем только маркированный товар.
	Дата1 =  ТекущаяДата()- 30*24*60*60; //константы.ДатаЗапретаРедактирования.Получить();  //с даты запрета редактирования
	Дата2 = ТекущаяДата()-24*60*60;  // вчерашний день
	
	// проверка, что уже есть - не нужно, будем смотреть по маркам.
	//-------------------------------------------------------------------------------------
	// выбрали все РНК, что есть, по условиям, и проверим все ли марки по ним отправлены, чтобы ускорить запрос. 
	//нечаева 22,10,28++ опечатка была
	ОрганизацияПоиска =  Справочники.Организации.НайтиПоКоду("SSR-03");  // МП Стиль    
	// нечаева 22,10,25---
	КонтрагентПоиска = Справочники.Контрагенты.НайтиПоКоду("SSR-9059");;   // РВБ
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	               |ГДЕ
	               |	РасходнаяНакладная.Организация = &ТекОрг
	               |	И РасходнаяНакладная.Контрагент = &ТекКонтр
	               |	И РасходнаяНакладная.Отгружен = &отгружен
	               |	И РасходнаяНакладная.Дата >= &ДатаНач
	               |	И РасходнаяНакладная.Дата <= &ДатаКон
	               |	И РасходнаяНакладная.Проведен = ИСТИНА
	               |	И РасходнаяНакладная.ТребуетсяМаркировка = ИСТИНА
	               |	И РасходнаяНакладная.КодОперации = &комиссия";

	Запрос.УстановитьПараметр("ТекОрг",ОрганизацияПОиска);
	Запрос.УстановитьПараметр("ТекКонтр",КонтрагентПоиска);
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Дата2));
	Запрос.УстановитьПараметр("отгружен",перечисления.Отгружен.Отгружен);
	Запрос.УстановитьПараметр("комиссия",перечисления.КодыОперацийОстатки.Комиссия);
	
	Рез = Запрос.Выполнить().Выгрузить();
		
	СписокРНК = рез.ВыгрузитьКолонку("Ссылка");
	
//	Сообщить("Количество РНК "+СписокРНК.Количество()+" "+КонтрагентПоиска+" "+ОрганизацияПоиска);
	
	//---------------------------------------------------------------------------------------------
	//              выберем все неотправленные марки по этим РНК , их потом будем добавлять в ХКМ
	//----------------------------------------------------------------------------------------------
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки КАК ШтрихКодУпаковки,
	               |	СтатусыКМ_ЧЗСрезПоследних.Регистратор.ДокОснование КАК РегистраторДокОснование,
	               |	СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки.Владелец КАК Товар,
	               |	СУММА(ВложенныйЗапрос.ПризнакБТК) КАК ПризнакБТК,
	               |	СтатусыКМ_ЧЗСрезПоследних.Статус КАК Статус
	               |ПОМЕСТИТЬ ДанныеПоМаркам
	               |ИЗ
	               |	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_ЧЗСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			СтатусыКМ_Факт.Местонахождение КАК Местонахождениеб,
	               |			СтатусыКМ_Факт.ШтрихКодУпаковки КАК ШтрихКодУпаковкиб,
	               |			ВЫБОР
	               |				КОГДА СтатусыКМ_Факт.Местонахождение = &бтк
	               |					ТОГДА 1
	               |				ИНАЧЕ 0
	               |			КОНЕЦ КАК ПризнакБТК
	               |		ИЗ
	               |			РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт) КАК ВложенныйЗапрос
	               |		ПО СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки = ВложенныйЗапрос.ШтрихКодУпаковкиб
	               |ГДЕ
	               |	СтатусыКМ_ЧЗСрезПоследних.Регистратор.ДокОснование В ИЕРАРХИИ(&текрнк)
	               |	И СтатусыКМ_ЧЗСрезПоследних.Статус <> &Выбыл
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки,
	               |	СтатусыКМ_ЧЗСрезПоследних.Регистратор,
	               |	СтатусыКМ_ЧЗСрезПоследних.Местонахождение,
	               |	СтатусыКМ_ЧЗСрезПоследних.Регистратор.ДокОснование,
	               |	СтатусыКМ_ЧЗСрезПоследних.ШтрихКодУпаковки.Владелец,
	               |	СтатусыКМ_ЧЗСрезПоследних.Период,
	               |	СтатусыКМ_ЧЗСрезПоследних.Активность,
	               |	ВложенныйЗапрос.ШтрихКодУпаковкиб,
	               |	СтатусыКМ_ЧЗСрезПоследних.Статус
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеПоМаркам.ШтрихКодУпаковки КАК марка,
	               |	ДанныеПоМаркам.ШтрихКодУпаковки.Владелец КАК Номенклатура,
	               |	ДанныеПоМаркам.РегистраторДокОснование КАК ДокРНК,
	               |	ДанныеПоМаркам.ПризнакБТК КАК ПризнакБТК,
	               |	ВложенныйЗапрос.Цена КАК Цена,
	               |	ВложенныйЗапрос.Скидка КАК Скидка,
	               |	1 КАК Количество,
	               |	ВложенныйЗапрос.ЦенаБезСкидки КАК ЦенаБезСкидки,
	               |	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	               |	ВложенныйЗапрос.Ссылка1 КАК Ссылка1
	               |ИЗ
	               |	ДанныеПоМаркам КАК ДанныеПоМаркам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	               |			РасходнаяНакладнаяТовары.Цена КАК Цена,
	               |			РасходнаяНакладнаяТовары.ТипЦен КАК ТипЦен,
	               |			РасходнаяНакладнаяТовары.Скидка КАК Скидка,
	               |			РасходнаяНакладнаяТовары.ЦенаБезСкидки КАК ЦенаБезСкидки,
	               |			РасходнаяНакладнаяТовары.Ссылка КАК Ссылка,
	               |			РасходнаяНакладнаяТовары.СтавкаНДС КАК СтавкаНДС,
	               |			РасходнаяНакладнаяТовары.Ссылка КАК Ссылка1
	               |		ИЗ
	               |			Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |		ГДЕ
	               |			РасходнаяНакладнаяТовары.Ссылка В ИЕРАРХИИ(&текрнк)) КАК ВложенныйЗапрос
	               |		ПО ДанныеПоМаркам.РегистраторДокОснование = ВложенныйЗапрос.Ссылка
	               |			И ДанныеПоМаркам.Товар = ВложенныйЗапрос.Номенклатура
	               |ГДЕ
	               |	ДанныеПоМаркам.ПризнакБТК = 0";
	Запрос.УстановитьПараметр("ТекРНК", СписокРнк);
	Запрос.УстановитьПараметр("бтк", Справочники.Контрагенты.НайтиПоКоду("SST-3886"));  // МП Стиль
	Запрос.УстановитьПараметр("Выбыл", Перечисления.СтатусыКодовМаркировкиФакт.Выбыл);
	

	ТЗТовары_Марки =запрос.Выполнить().Выгрузить();
	// тут и цены сразу, и товары, и марки.
	
	Если ТЗТовары_Марки.Количество()<=0 ТОгда
		ЕстьОШибка=истина;

		//сообщить("Не отправленных марок по РВБ на БТК нет, документы не сформированы!"+ТекущаяДата());
		ЗаписатьВЛог("Маркировка","Не отправленных марок по РВБ на МП Стиль нет, документы не сформированы!"+ТекущаяДата(),,,,);
		возврат;
		 
	КонецЕсли;	
	
	//ТЗТовары_Марки.Свернуть("Марка, Номенклатура, Цена, ЦенаБезСкидки,ДокРНК","Количество");

	ТЗТОвары = ТЗТовары_Марки.Скопировать();
	ТЗТовары.Свернуть("Номенклатура, Цена, ЦенаБезСкидки","Количество");

	
	СсылкаНаОбъект = СписокРНК[0];
	//возврат;
	// шапку заполнять по первому документу
	// первый документ
	Док1= СписокРНК[0];
	ДокПолучатель=Документы.РасходнаяНакладная.СоздатьДокумент();	
	ЗаполнитьШапкуДокумента(ДокПолучатель,ПараметрыСеанса.Пользователь);
		
	ШаблонРеквизитов = "ИБ,Менеджер,БанковскийСчет,ДатаОтгрузки,Валюта,
	|ОтсрочкаПлатежа,ВидОплаты,ТипЦен,ТипСкидок,Скидка,ТранспортнаяКомпания,СкладКомиссия,ДатаОплаты,КодПоставщика";	
		
	СписокРеквизитов = ЗаполнениеДокументов.СформироватьСтрокуРеквизитовПоШаблону(Док1, ШаблонРеквизитов);
	ЗаполнитьЗначенияСвойств(ДокПолучатель, Док1, СписокРеквизитов);
	ДокПолучатель.ТребуетсяМаркировка =истина;
	ДокПолучатель.МеждуСвоимиОрганизациями = истина;
	ДокПолучатель.Организация = Организация;
	Докполучатель.Договор =договор;
	ДокПолучатель.Контрагент = контрагент;
	ДокПолучатель.Склад = склад;
	ДокПолучатель.ПунктДоставки = ПунктДоставки;
	ДокПолучатель.СостояниеНакладной = перечисления.СостоянияНакладной.Отгружена;
	ДокПолучатель.Отгружен = перечисления.Отгружен.Отгружен;
	ДокПолучатель.КодОперации = перечисления.КодыОперацийОстатки.Комиссия;
	ДокПолучатель.Дата = КонецДня(текущаядата()-24*60*60);
	ДокПолучатель.ДатаОтгрузки = текущаядата()-24*60*60; //---------
	ДокПолучатель.Подразделение = ДокПолучатель.Менеджер.Подразделение;
	//нечаева 22,10,25+++
	ТипДоставки=ПунктДоставки.ТипДоставки;
	// нечаева 22,10,25--- 
	//++Данилова Е.В. 30.09.2025  HELP-7048 
	//ДокПолучатель.Подразделение = ДокПолучатель.Менеджер.Подразделение;
	ДокПолучатель.Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(ДокПолучатель.Менеджер);
	//--Данилова Е.В. 30.09.2025

	Если ДокПолучатель.Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		ДокПолучатель.Подразделение = ДокПолучатель.Склад.Подразделение;
	КонецЕсли;
	
	// заполняем товары
	Для каждого ТекСтрока из ТЗТовары Цикл    // только по товарам, чтобы свернулось
		//ОбработкаПрерыванияПользователя();
		//Состояние("Обработка: " + ТекСтрока.Номенклатура);
		
		Если ТекСтрока.количество =0 Тогда Продолжить КонецЕсли;
		
		СтрокаТЧ = ДокПолучатель.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ТекСтрока);
		
		СтрокаТЧ.Заявка=ТекСтрока.Количество;	
		СтрокаТЧ.ПодтвержденнаяЗаявка=ТекСтрока.Количество;	
			
		СтрокаТЧ.Цена=ТекСтрока.Цена;
		
		ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ,ДокПолучатель);
		СтрокаТЧ.ЦенаБезСкидки=ТекСтрока.Цена;

		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокПолучатель,Неопределено);  //"ОтВсего");
		
	КонецЦикла;	
	КонтрольДублейСтрок(ДокПолучатель);

	// свернуть по строкам?
	ПересчетТЧ(ДокПолучатель,"Товары",ДокПолучатель.Валюта,ДокПолучатель.Валюта,ДокПолучатель.Курс,ДокПолучатель.Курс,Истина);
	
	// ??? временно
	Для Каждого Накладная Из СписокРНК Цикл
		Если ПустаяСтрока(ДокПолучатель.Комментарий) Тогда 
			ДокПолучатель.Комментарий = Накладная.Метаданные().Имя + " " + Накладная.Номер;
		иначе
			ДокПолучатель.Комментарий = ДокПолучатель.Комментарий + ", " + Накладная.Номер;
		КонецЕсли;
	КонецЦикла;
	//ДокПолучатель.ПолучитьФорму().Открыть();
	
	//ДокПолучатель.Дата =  КонецДня(док1.датаОтгрузки); 
	ЕстьОшибка = ложь;
	попытка
		ДокПолучатель.Записать(РежимЗаписиДокумента.Проведение);
	исключение
		ЕстьОШибка=истина;
		ЗаписатьВЛог("Маркировка","Не удалось записать документ РНК, на БТК - "+ТекущаяДата()+" "+ОписаниеОшибки(),,,,);
		возврат; // чтобы не писалась ХКМ, и марки остануться на БТК, без УПД
	КонецПопытки;
	
	//------------------------------------------------------------------------------------------
	//      создаем ХКМ
	//------------------------------------------------------------------------------------------
	
	Если ЕстьОШибка=истина ТОгда
		возврат;
	КонецЕсли;	
	
	ДокументХКМ = Документы.ХранилищеКодовМаркировки.ПустаяСсылка(); 
	
	ДокументХКМ = документы.ХранилищеКодовМаркировки.СоздатьДокумент();
	ДокументХКМ.Автор = ПараметрыСеанса.Пользователь;
	ДокументХКМ.ДокОснование = ДокПолучатель.ссылка;
	ДокументХКМ.Организация = ДокПолучатель.организация; // единая европа?  пусть пока бтк
	ДокументХКМ.ПланФакт = перечисления.ПланФакт.План;
	ДокументХКМ.Получатель = ДокПолучатель.контрагент; //???  бтк
	ДокументХКМ.Комментарий = "Передача на БТК (для РВБ)";
	ДокументХКМ.дата =  КонецДня(текущаядата()-24*60*60);//КонецДня(ДокПолучатель.дата);
	ДокументХКМ.УстановитьНовыйНомер( "PPP"+"-");
	
	// заполняем марками
	//-------------------------------------------
	ТЗТовары_Марки.Сортировать("Марка");
	
	Для каждого ТекстрМ из ТЗТовары_Марки цикл   
		ТекМаркаТ = ТекстрМ.Марка;
		//сообщить(ТекстрМ.Марка);
		МаркаН = ДокументХКМ.ШтрихкодыУпаковок.добавить();
		МаркаН.ШтрихкодУпаковки = ТекстрМ.Марка;
	КонецЦикла;
	
	попытка
		ДокументХКМ.Записать(РежимЗаписиДокумента.Проведение);
	исключение
		ЗаписатьВЛог("Маркировка","Не удалось записать документ ХКМ, на БТК - "+ТекущаяДата()+" "+ОписаниеОшибки(),,,,);
		//сообщить(описаниеошибки());
	КонецПопытки;

	//сообщить(ДокПолучатель);
	//сообщить(ДокументХКМ);
	//-----------------------------------------------
	
    
КонецПроцедуры

// Нечаева 19,09,25--- для МПСтиля
